load-testing/artillery-config.yml
# Artillery Load Testing Configuration for ASR Purchase Order System
# Phase 4C Performance Validation

config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 2
      name: "Warm-up"

    # Dashboard load test - Target: <2s response
    - duration: 60
      arrivalRate: 10
      name: "Dashboard Performance Test"

    # Report generation test - Target: <10s response
    - duration: 120
      arrivalRate: 5
      name: "Report Generation Test"

    # Peak load simulation - Target: <500ms for 95% of API calls
    - duration: 60
      arrivalRate: 20
      name: "Peak Load Test"

  defaults:
    headers:
      'User-Agent': 'Artillery ASR PO System Load Test'
      'Content-Type': 'application/json'

  # Performance targets from Phase 4C requirements
  ensure:
    maxErrorRate: 1          # Max 1% error rate
    p95: 2000               # 95% of requests under 2s (dashboard target)
    p99: 10000              # 99% of requests under 10s (report target)

scenarios:
  # Dashboard performance test - Primary user workflow
  - name: "Dashboard Load Test"
    weight: 40
    flow:
      - get:
          url: "/api/dashboards/kpi-metrics"

      - get:
          url: "/api/dashboards/pending-approvals"

      - get:
          url: "/api/dashboards/division"

      - think: 2  # User reading time

      - get:
          url: "/api/po/recent"

  # Report generation performance test - Business intelligence workflows
  - name: "Report Generation Test"
    weight: 30
    flow:
      # Test all 6 business reports
      - get:
          url: "/api/reports/po-summary?startDate=2024-01-01&endDate=2024-12-31"

      - think: 1

      - get:
          url: "/api/reports/project-details?startDate=2024-01-01&endDate=2024-12-31"

      - think: 1

      - get:
          url: "/api/reports/vendor-analysis?startDate=2024-01-01&endDate=2024-12-31"

      - think: 1

      - get:
          url: "/api/reports/gl-analysis?startDate=2024-01-01&endDate=2024-12-31"

      - think: 1

      - get:
          url: "/api/reports/budget-vs-actual?startDate=2024-01-01&endDate=2024-12-31"

      - think: 1

      - get:
          url: "/api/reports/approval-bottleneck?startDate=2024-01-01&endDate=2024-12-31"

  # API endpoint stress test - Core system operations
  - name: "API Stress Test"
    weight: 20
    flow:
      # Test critical API endpoints with 500ms target
      - get:
          url: "/api/po/list"

      - get:
          url: "/api/vendors/list"

      - get:
          url: "/api/projects/list"

      - get:
          url: "/api/divisions/list"

      - get:
          url: "/api/health"

  # CSV Export performance test - Large dataset handling
  - name: "Export Performance Test"
    weight: 10
    flow:
      # Test CSV exports for large datasets
      - get:
          url: "/api/reports/po-summary?format=csv&startDate=2024-01-01&endDate=2024-12-31"

      - think: 2

      - get:
          url: "/api/reports/project-details?format=csv&startDate=2024-01-01&endDate=2024-12-31"

      - think: 2

      - get:
          url: "/api/reports/vendor-analysis?format=csv&startDate=2024-01-01&endDate=2024-12-31"